ДоработкаПриложения/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="383534dc-767e-40f6-bfb4-ddb521dc281e">
  <name>ЗаказПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e0c51a0f-3e61-4782-9d45-5f23a8ba9053">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0b4542f-3a0e-40aa-b32a-e0d5ca221ddc">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1e5697b-547e-44f7-b88b-ea8aff70a8f0">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6cf5983-d8cf-465d-8adf-e3bb9a576e3d">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f12d6b77-728f-4e50-8592-832c880a0f49">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="443c1550-1fb1-493e-9705-11aa3a1453e3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДП_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДП_КонтактныеЛицаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДП_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="e45e2b26-9d6f-4cbd-a044-788972210d49">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e8b8451d-5303-41b8-9491-ec4040bc2b74">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="015f0a7e-c9c4-456e-a934-e37e199ccc7b">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="09fdbfad-36d9-45d8-90a3-e9e8ea22200c">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ec24df9c-d0cf-40b4-857d-d8ce21b0e1fa">
      <name>Скидка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4c473d65-4481-4028-8ddd-9ce7fd6688b9">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4cc0ecaa-0407-4af7-90cf-8e1a70bf02fe">
    <name>Услуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0e57517e-b8fa-4bd4-b55c-4396efcecd25">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="568ebf94-8e57-46de-8180-0ac0dfb60345">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5ae5c5d0-18a4-4a1c-b29d-c7646e6d749e">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="537e3112-0e4a-40d8-af2c-f78c53184e09">
      <name>Скидка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5b27694d-ce0d-4a45-a1ec-96b0bea5e9d1">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДоработкаПриложения/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДП_ДП_СогласованнаяСкидкаПриИзмененииПосле(Элемент)
	
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ДП_ПослеОтветаНаВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Изменился процент скидки. Пересчитать табличную часть?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&ИзменениеИКонтроль("РассчитатьСуммуСтроки")
&НаКлиенте
Процедура ДП_РассчитатьСуммуСтроки(ТекущиеДанные)
    #Удаление
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
    #КонецУдаления

	#Вставка 
	ДП_ПересчитатьКолонкуСумма(ТекущиеДанные);
	#КонецВставки
	
КонецПроцедуры
&НаКлиенте
Процедура ДП_ПересчитатьТаблицуПосле(Команда)
	
	Если ДП_НетДанныхВТаблицах()Или НЕ ЗначениеЗаполнено(Объект.ДП_СогласованнаяСкидка) Тогда
		Возврат; 
	КонецЕсли;
	
	ДП_РассчитатьСуммуСтрок(); 
КонецПроцедуры


&НаКлиенте 
Процедура ДП_ПослеОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДП_РассчитатьСуммуСтрок();      
	
КонецПроцедуры

&НаКлиенте
Функция ДП_НетДанныхВТаблицах()
	
	Возврат Объект.Товары.Количество() = 0 И Объект.Услуги.Количество()= 0;
	
КонецФункции 

&НаКлиенте
Процедура ДП_РассчитатьСуммуСтрок() 
	
	Для Каждого Строка Из Объект.Товары Цикл
		ДП_ПересчитатьКолонкуСумма(Строка);
	КонецЦикла;   
	
	Для Каждого Строка Из Объект.Услуги Цикл
		ДП_ПересчитатьКолонкуСумма(Строка);
	КонецЦикла; 
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры 

&НаКлиенте
Процедура ДП_ПересчитатьКолонкуСумма(Строка)
	
	КоэффициентСкидки = 1 - (Строка.Скидка + Объект.ДП_СогласованнаяСкидка)/ 100;
	
	Если КоэффициентСкидки > 0 Тогда
	    Строка.Сумма = Строка.Цена * Строка.Количество* КоэффициентСкидки;
	Иначе
		Строка.Сумма = 0;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
